[
  {
    "slug": "moonlight-sonata",
    "piece_title": "Piano Sonata No. 14 \"Moonlight Sonata\"",
    "composer": "Ludwig van Beethoven",
    "composer_lifespan": "1770–1827",
    "era": "Classical",
    "difficulty": "Intermediate",
    "year": 1801,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/Piano_Sonata_No.14,_Op.27_No.2_(Beethoven,_Ludwig_van)",
    "scores_url": "https://imslp.org/wiki/Piano_Sonata_No.14,_Op.27_No.2_(Beethoven,_Ludwig_van)#tabScores",
    "embed": false,
    "description": "Beethoven's Piano Sonata No. 14 in C-sharp minor, Op. 27 No. 2, nicknamed the \"Moonlight Sonata\" by poet Ludwig Rellstab, is one of the most recognisable works in the piano repertoire. Composed in 1801 and dedicated to Countess Giulietta Guicciardi, the sonata broke conventions by opening with a slow, meditative Adagio sostenuto rather than a fast movement.\n\nThe famous first movement features a repeating triplet figure over a singing melody in the bass, creating a hypnotic, almost improvisatory atmosphere. The second movement is a lighter Allegretto that serves as a brief respite, while the third movement erupts into a fiery Presto agitato full of dramatic arpeggios and powerful octaves. The first movement is accessible to intermediate players, though the third movement demands advanced technique.",
    "related_slugs": ["fur-elise", "pathetique-sonata"]
  },
  {
    "slug": "fur-elise",
    "piece_title": "Für Elise, WoO 59",
    "composer": "Ludwig van Beethoven",
    "composer_lifespan": "1770–1827",
    "era": "Classical",
    "difficulty": "Beginner",
    "year": 1810,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/F%C3%BCr_Elise,_WoO_59_(Beethoven,_Ludwig_van)",
    "scores_url": "https://imslp.org/wiki/F%C3%BCr_Elise,_WoO_59_(Beethoven,_Ludwig_van)#tabScores",
    "embed": false,
    "description": "Für Elise is arguably the most famous piano piece ever written, recognised worldwide by its delicate opening motif of alternating E and D-sharp. Composed around 1810, the piece was not published during Beethoven's lifetime — it was discovered in 1867 by Ludwig Nohl, and the identity of \"Elise\" remains a mystery to this day.\n\nStructured as a rondo (A–B–A–C–A), the main theme is gentle and approachable, making it one of the first classical pieces many students learn. The B section introduces a warmer, more lyrical passage in F major, while the C section brings unexpected drama with rapid arpeggios and a stormy character. The main theme is ideal for beginners, while performing the complete piece with all three sections requires a solid intermediate foundation.",
    "related_slugs": ["moonlight-sonata", "sonata-c-major-k545"]
  },
  {
    "slug": "clair-de-lune",
    "piece_title": "Clair de Lune (Suite bergamasque, L. 75)",
    "composer": "Claude Debussy",
    "composer_lifespan": "1862–1918",
    "era": "Impressionist",
    "difficulty": "Advanced",
    "year": 1905,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/Suite_bergamasque_(Debussy,_Claude)",
    "scores_url": "https://imslp.org/wiki/Suite_bergamasque_(Debussy,_Claude)#tabScores",
    "embed": false,
    "description": "Clair de Lune, the third movement of Debussy's Suite bergamasque, is one of the most beloved piano pieces in the impressionist tradition. Its title, meaning \"Moonlight,\" is drawn from a poem by Paul Verlaine. Though the suite was sketched as early as 1890, it was not published until 1905, by which time Debussy had significantly revised it.\n\nThe piece opens with a gentle, floating melody in D-flat major that unfolds with an almost improvisatory freedom. The middle section builds to a shimmering climax of wide arpeggios and rich harmonies before the opening theme returns in a more decorated form. Performing Clair de Lune requires careful pedalling, tonal control, and the ability to shape long, singing phrases — skills that make it a rewarding challenge for advanced players.",
    "related_slugs": ["arabesque-no-1", "reverie"]
  },
  {
    "slug": "prelude-c-major-bwv-846",
    "piece_title": "Prelude in C Major, BWV 846",
    "composer": "Johann Sebastian Bach",
    "composer_lifespan": "1685–1750",
    "era": "Baroque",
    "difficulty": "Beginner",
    "year": 1722,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/Prelude_and_Fugue_in_C_major,_BWV_846_(Bach,_Johann_Sebastian)",
    "scores_url": "https://imslp.org/wiki/Prelude_and_Fugue_in_C_major,_BWV_846_(Bach,_Johann_Sebastian)#tabScores",
    "embed": false,
    "description": "The Prelude in C Major is the very first piece in Bach's Well-Tempered Clavier, Book I — a monumental collection of 48 preludes and fugues in all major and minor keys. Written around 1722, the WTC was intended as both a pedagogical work and a demonstration that keyboard instruments could be tuned to play comfortably in every key.\n\nThis prelude consists entirely of broken-chord arpeggios, with each bar following the same rhythmic pattern over a slowly shifting harmonic progression. Its simplicity makes it one of the most accessible introductions to Bach's keyboard music, yet its harmonic richness rewards close listening. The piece later inspired Gounod to compose his famous \"Ave Maria\" as a melody over Bach's original harmonies.",
    "related_slugs": ["invention-no-1-bwv-772", "gymnopedie-no-1"]
  },
  {
    "slug": "gymnopedie-no-1",
    "piece_title": "Gymnopédie No. 1",
    "composer": "Erik Satie",
    "composer_lifespan": "1866–1925",
    "era": "Romantic",
    "difficulty": "Beginner",
    "year": 1888,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/3_Gymnop%C3%A9dies_(Satie,_Erik)",
    "scores_url": "https://imslp.org/wiki/3_Gymnop%C3%A9dies_(Satie,_Erik)#tabScores",
    "embed": false,
    "description": "Satie's Gymnopédie No. 1 is a masterpiece of simplicity and atmosphere. Published in 1888, the three Gymnopédies take their name from an ancient Greek festival honouring Apollo. With its sparse texture and gentle dissonances, the first Gymnopédie was decades ahead of its time, anticipating the impressionist and ambient music movements.\n\nThe piece is marked \"Lent et douloureux\" (slowly and sorrowfully) and consists of a simple, wistful melody floating over alternating major seventh and minor seventh chords in a gentle 3/4 waltz rhythm. Its technical simplicity — mostly single notes in the right hand and two-note chords in the left — makes it accessible to beginners, though capturing its dreamy mood requires musical sensitivity and careful use of the sustain pedal.",
    "related_slugs": ["prelude-c-major-bwv-846", "prelude-e-minor-op28-no4"]
  },
  {
    "slug": "nocturne-op9-no2",
    "piece_title": "Nocturne in E-flat Major, Op. 9 No. 2",
    "composer": "Frédéric Chopin",
    "composer_lifespan": "1810–1849",
    "era": "Romantic",
    "difficulty": "Intermediate",
    "year": 1832,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/Nocturnes,_Op.9_(Chopin,_Fr%C3%A9d%C3%A9ric)",
    "scores_url": "https://imslp.org/wiki/Nocturnes,_Op.9_(Chopin,_Fr%C3%A9d%C3%A9ric)#tabScores",
    "embed": false,
    "description": "The Nocturne in E-flat Major is the most popular of Chopin's 21 nocturnes and one of the defining pieces of the Romantic era. Published in 1832 when Chopin was just 22, it was dedicated to Madame Camille Pleyel and quickly became a favourite in the salons of Paris.\n\nThe piece features a singing right-hand melody that becomes increasingly ornamented with each return, accompanied by a gently rocking left-hand pattern of wide arpeggios. Chopin's writing imitates the art of bel canto singing, with graceful turns, trills, and cadenza-like passages that demand both technical fluency and expressive nuance. The nocturne is a perfect introduction to Chopin's lyrical style for intermediate players looking to develop their tonal palette.",
    "related_slugs": ["minute-waltz", "prelude-e-minor-op28-no4"]
  },
  {
    "slug": "minute-waltz",
    "piece_title": "Waltz in D-flat Major, Op. 64 No. 1 \"Minute Waltz\"",
    "composer": "Frédéric Chopin",
    "composer_lifespan": "1810–1849",
    "era": "Romantic",
    "difficulty": "Intermediate",
    "year": 1847,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/Waltzes,_Op.64_(Chopin,_Fr%C3%A9d%C3%A9ric)",
    "scores_url": "https://imslp.org/wiki/Waltzes,_Op.64_(Chopin,_Fr%C3%A9d%C3%A9ric)#tabScores",
    "embed": false,
    "description": "Chopin's Waltz in D-flat Major, Op. 64 No. 1, is affectionately known as the \"Minute Waltz\" — a nickname that refers to its small (\"minute\") scale rather than a one-minute time limit, though pianists have long enjoyed the challenge of playing it at breakneck speed. Composed in 1847, legend has it that Chopin was inspired by watching George Sand's little dog chase its own tail.\n\nThe waltz opens with a whirling, descending figure that spins continuously before giving way to a gentler, more lyrical middle section in the relative minor. The return of the opening theme brings the piece to a sparkling close. Despite its brevity — roughly one and a half minutes at a moderate tempo — it requires nimble fingerwork and elegant phrasing, making it an excellent study piece for intermediate pianists building speed and lightness of touch.",
    "related_slugs": ["nocturne-op9-no2", "fantaisie-impromptu"]
  },
  {
    "slug": "rondo-alla-turca",
    "piece_title": "Rondo Alla Turca (Piano Sonata No. 11, K. 331)",
    "composer": "Wolfgang Amadeus Mozart",
    "composer_lifespan": "1756–1791",
    "era": "Classical",
    "difficulty": "Intermediate",
    "year": 1783,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/Piano_Sonata_No.11_in_A_major,_K.331/300i_(Mozart,_Wolfgang_Amadeus)",
    "scores_url": "https://imslp.org/wiki/Piano_Sonata_No.11_in_A_major,_K.331/300i_(Mozart,_Wolfgang_Amadeus)#tabScores",
    "embed": false,
    "description": "The Rondo Alla Turca, or \"Turkish March,\" is the famous third movement of Mozart's Piano Sonata No. 11 in A major, K. 331. Composed around 1783, the movement reflects the 18th-century European fascination with Turkish military music, imitating the sound of janissary bands with their drums, cymbals, and bells.\n\nThe rondo alternates between playful, march-like episodes and a recurring theme built on crisp staccato passages and wide leaps. Mozart's writing captures both the exotic flavour of the \"alla turca\" style and his own inimitable wit and elegance. The piece is a perennial favourite at recitals and a staple of the intermediate repertoire, requiring clean articulation, rhythmic precision, and a sense of fun.",
    "related_slugs": ["sonata-c-major-k545", "fur-elise"]
  },
  {
    "slug": "pathetique-sonata",
    "piece_title": "Piano Sonata No. 8 \"Pathétique\", Op. 13",
    "composer": "Ludwig van Beethoven",
    "composer_lifespan": "1770–1827",
    "era": "Classical",
    "difficulty": "Advanced",
    "year": 1798,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/Piano_Sonata_No.8,_Op.13_(Beethoven,_Ludwig_van)",
    "scores_url": "https://imslp.org/wiki/Piano_Sonata_No.8,_Op.13_(Beethoven,_Ludwig_van)#tabScores",
    "embed": false,
    "description": "Beethoven's \"Pathétique\" Sonata in C minor, Op. 13, published in 1799, was one of the young composer's most ambitious and emotionally charged works. Its title, chosen by Beethoven himself, signals the dramatic, passionate character that permeates all three movements. The sonata was an immediate success and remains one of Beethoven's most frequently performed piano works.\n\nThe first movement opens with a grave, imposing introduction that returns twice during the turbulent Allegro, creating an almost operatic sense of drama. The second movement, Adagio cantabile, is one of the most beautiful slow movements in the entire piano literature — a serene, singing melody in A-flat major. The finale is a vigorous rondo that combines rhythmic energy with moments of lyrical tenderness. The sonata demands both technical command and emotional depth from the performer.",
    "related_slugs": ["moonlight-sonata", "prelude-c-sharp-minor"]
  },
  {
    "slug": "prelude-c-sharp-minor",
    "piece_title": "Prelude in C-sharp Minor, Op. 3 No. 2",
    "composer": "Sergei Rachmaninoff",
    "composer_lifespan": "1873–1943",
    "era": "Romantic",
    "difficulty": "Advanced",
    "year": 1892,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/Morceaux_de_fantaisie,_Op.3_(Rachmaninoff,_Sergei)",
    "scores_url": "https://imslp.org/wiki/Morceaux_de_fantaisie,_Op.3_(Rachmaninoff,_Sergei)#tabScores",
    "embed": false,
    "description": "Rachmaninoff composed his famous Prelude in C-sharp Minor in 1892, when he was just 19 years old. It became so overwhelmingly popular that audiences demanded it as an encore at virtually every concert for the rest of his career — a popularity that Rachmaninoff himself found both flattering and tiresome. The piece is the second of his five Morceaux de fantaisie, Op. 3.\n\nThe prelude opens with three massive, tolling chords that immediately establish a dark, brooding atmosphere. The central Agitato section surges with passionate arpeggios and powerful octave passages that build to a thunderous climax, before the opening chords return in a richly voiced coda that fades into silence. The piece requires large hands, considerable dynamic range, and the ability to project both intimate detail and orchestral grandeur from the keyboard.",
    "related_slugs": ["pathetique-sonata", "ballade-no-1"]
  },
  {
    "slug": "arabesque-no-1",
    "piece_title": "Arabesque No. 1 (Deux Arabesques, L. 66)",
    "composer": "Claude Debussy",
    "composer_lifespan": "1862–1918",
    "era": "Impressionist",
    "difficulty": "Intermediate",
    "year": 1891,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/2_Arabesques_(Debussy,_Claude)",
    "scores_url": "https://imslp.org/wiki/2_Arabesques_(Debussy,_Claude)#tabScores",
    "embed": false,
    "description": "Debussy's Arabesque No. 1 in E major is one of his earliest and most approachable works, composed around 1888–1891. The title refers to the decorative arabesques found in Islamic art and architecture — intricate, flowing patterns that Debussy translates into music through sinuous melodies and gently shifting harmonies.\n\nThe piece opens with flowing triplet arpeggios that weave around a lyrical melody, creating a sense of graceful, unhurried movement. A contrasting middle section in A major introduces a more chordal texture before the shimmering triplets return. The Arabesque offers an excellent introduction to impressionist piano technique, requiring smooth legato playing, independence between the hands, and careful attention to voicing and pedalling.",
    "related_slugs": ["clair-de-lune", "reverie"]
  },
  {
    "slug": "invention-no-1-bwv-772",
    "piece_title": "Invention No. 1 in C Major, BWV 772",
    "composer": "Johann Sebastian Bach",
    "composer_lifespan": "1685–1750",
    "era": "Baroque",
    "difficulty": "Beginner",
    "year": 1723,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/Invention_in_C_major,_BWV_772_(Bach,_Johann_Sebastian)",
    "scores_url": "https://imslp.org/wiki/Invention_in_C_major,_BWV_772_(Bach,_Johann_Sebastian)#tabScores",
    "embed": false,
    "description": "Bach's Two-Part Invention No. 1 in C Major is the opening piece of his 15 Inventions, a set of short contrapuntal works composed in 1720–1723 for the musical education of his eldest son, Wilhelm Friedemann. Bach described their purpose as teaching students to develop independence of the hands and to cultivate a \"cantabile\" (singing) style of playing.\n\nThe invention introduces a short, energetic motif in the right hand that is immediately imitated by the left hand, establishing a lively dialogue between the two voices. The motif is developed through sequences, inversions, and modulations before the piece resolves back to C major. At just 22 bars, it is an ideal first encounter with polyphonic keyboard writing and an essential step for any student progressing towards Bach's more complex works.",
    "related_slugs": ["prelude-c-major-bwv-846", "sonata-c-major-k545"]
  },
  {
    "slug": "fantaisie-impromptu",
    "piece_title": "Fantaisie-Impromptu in C-sharp Minor, Op. 66",
    "composer": "Frédéric Chopin",
    "composer_lifespan": "1810–1849",
    "era": "Romantic",
    "difficulty": "Advanced",
    "year": 1834,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/Fantaisie-impromptu,_Op.66_(Chopin,_Fr%C3%A9d%C3%A9ric)",
    "scores_url": "https://imslp.org/wiki/Fantaisie-impromptu,_Op.66_(Chopin,_Fr%C3%A9d%C3%A9ric)#tabScores",
    "embed": false,
    "description": "The Fantaisie-Impromptu is one of Chopin's most dazzling and technically demanding showpieces. Composed in 1834, Chopin withheld it from publication during his lifetime — possibly because he felt it resembled Moscheles' Impromptu, Op. 89 too closely. It was published posthumously in 1855 by his friend Julian Fontana.\n\nThe outer sections feature cascading semiquaver passages in the right hand set against triplets in the left, creating a mesmerising cross-rhythm of four against three that is the piece's central technical challenge. The dreamy middle section in D-flat major provides a lyrical contrast — its melody later inspired the popular song \"I'm Always Chasing Rainbows.\" The piece requires exceptional finger independence, rhythmic precision, and the ability to shift seamlessly between virtuosic fireworks and tender lyricism.",
    "related_slugs": ["minute-waltz", "ballade-no-1"]
  },
  {
    "slug": "sonata-c-major-k545",
    "piece_title": "Piano Sonata No. 16 in C Major, K. 545",
    "composer": "Wolfgang Amadeus Mozart",
    "composer_lifespan": "1756–1791",
    "era": "Classical",
    "difficulty": "Beginner",
    "year": 1788,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/Piano_Sonata_No.16_in_C_major,_K.545_(Mozart,_Wolfgang_Amadeus)",
    "scores_url": "https://imslp.org/wiki/Piano_Sonata_No.16_in_C_major,_K.545_(Mozart,_Wolfgang_Amadeus)#tabScores",
    "embed": false,
    "description": "Mozart described this sonata in his catalogue as a \"Sonata facile\" — a little sonata for beginners — and it has served as a gateway to the classical sonata form for countless piano students ever since. Composed in 1788 during one of the most productive periods of Mozart's life, it demonstrates that simplicity and elegance can go hand in hand.\n\nThe first movement opens with one of the most recognisable themes in classical music: a bright, ascending scale passage followed by an Alberti bass accompaniment. The second movement is a gentle Andante in G major, and the finale is a lively Rondo. Despite its apparent simplicity, performing it well requires crystalline clarity, precise articulation, and the ability to shape phrases with taste and subtlety — the very qualities that define Mozart's keyboard style.",
    "related_slugs": ["rondo-alla-turca", "fur-elise"]
  },
  {
    "slug": "consolation-no-3",
    "piece_title": "Consolation No. 3 in D-flat Major, S. 172",
    "composer": "Franz Liszt",
    "composer_lifespan": "1811–1886",
    "era": "Romantic",
    "difficulty": "Intermediate",
    "year": 1850,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/Consolations,_S.172_(Liszt,_Franz)",
    "scores_url": "https://imslp.org/wiki/Consolations,_S.172_(Liszt,_Franz)#tabScores",
    "embed": false,
    "description": "The Consolation No. 3 in D-flat Major is the most famous of Liszt's six Consolations, a set of lyrical miniatures composed around 1849–1850. Far from the thundering virtuosity for which Liszt is best known, these pieces reveal his gentler, more introspective side — influenced by the nocturnes of his friend Chopin and the poetic reveries of Lamartine.\n\nThe third Consolation unfolds as a long, singing melody over a rippling accompaniment, with a warmth and tenderness that make it one of Liszt's most immediately appealing works. The middle section introduces richer harmonies and a more impassioned tone before the opening melody returns, now adorned with delicate ornamentation. It is an ideal piece for intermediate players who want to explore Liszt's music without tackling his more fearsome technical demands.",
    "related_slugs": ["liebestraum-no-3", "nocturne-op9-no2"]
  },
  {
    "slug": "reverie",
    "piece_title": "Rêverie, L. 68",
    "composer": "Claude Debussy",
    "composer_lifespan": "1862–1918",
    "era": "Impressionist",
    "difficulty": "Intermediate",
    "year": 1890,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/R%C3%AAverie_(Debussy,_Claude)",
    "scores_url": "https://imslp.org/wiki/R%C3%AAverie_(Debussy,_Claude)#tabScores",
    "embed": false,
    "description": "Debussy's Rêverie, composed around 1890 and published in 1895, is one of his most accessible and melodically direct works. Although Debussy himself was somewhat dismissive of the piece in later years — feeling it was too conventional compared to his mature style — its charm and gentle beauty have ensured its enduring popularity with pianists and audiences alike.\n\nThe piece is built around a simple, memorable melody in F major that rises and falls with a natural, speech-like rhythm. Debussy weaves this theme through shifting harmonies and textures, creating an atmosphere of quiet daydreaming that perfectly matches its title. The Rêverie sits comfortably at an intermediate level, making it an excellent stepping stone towards Debussy's more harmonically adventurous works such as Clair de Lune and the Arabesques.",
    "related_slugs": ["arabesque-no-1", "clair-de-lune"]
  },
  {
    "slug": "ballade-no-1",
    "piece_title": "Ballade No. 1 in G Minor, Op. 23",
    "composer": "Frédéric Chopin",
    "composer_lifespan": "1810–1849",
    "era": "Romantic",
    "difficulty": "Advanced",
    "year": 1835,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/Ballade_No.1,_Op.23_(Chopin,_Fr%C3%A9d%C3%A9ric)",
    "scores_url": "https://imslp.org/wiki/Ballade_No.1,_Op.23_(Chopin,_Fr%C3%A9d%C3%A9ric)#tabScores",
    "embed": false,
    "description": "Chopin's Ballade No. 1 in G minor is widely regarded as one of the greatest piano compositions ever written. Composed between 1831 and 1835, it was the first of Chopin's four ballades and is believed to have been inspired by the narrative poetry of the Polish poet Adam Mickiewicz. Robert Schumann famously described it as Chopin's \"most spirited and daring\" work.\n\nThe ballade unfolds as a dramatic narrative, opening with a mysterious slow introduction before launching into a passionate first theme. A contrasting second theme in E-flat major provides moments of lyrical beauty, and the two themes are developed and transformed throughout, building to a ferocious coda of blazing octaves and sweeping arpeggios. Performing this piece demands advanced technique, stamina, and the interpretive maturity to sustain its emotional arc across nearly ten minutes of music.",
    "related_slugs": ["fantaisie-impromptu", "prelude-c-sharp-minor"]
  },
  {
    "slug": "maple-leaf-rag",
    "piece_title": "Maple Leaf Rag",
    "composer": "Scott Joplin",
    "composer_lifespan": "1868–1917",
    "era": "Ragtime",
    "difficulty": "Intermediate",
    "year": 1899,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/Maple_Leaf_Rag_(Joplin,_Scott)",
    "scores_url": "https://imslp.org/wiki/Maple_Leaf_Rag_(Joplin,_Scott)#tabScores",
    "embed": false,
    "description": "The Maple Leaf Rag, published in 1899, was one of the first pieces of sheet music to sell over one million copies and is the composition that launched the ragtime craze across America. Named after the Maple Leaf Club in Sedalia, Missouri, where Joplin performed regularly, it secured his reputation as the \"King of Ragtime\" and influenced generations of popular music.\n\nThe rag follows the classic ragtime structure of four distinct 16-bar strains (AA BB A CC DD), each featuring Joplin's trademark syncopated melodies in the right hand set against a steady \"oom-pah\" bass pattern in the left. The syncopation gives the music its infectious, toe-tapping energy, while the harmonic progressions reveal a sophistication that elevates ragtime far beyond mere novelty. Joplin insisted his rags should not be played too fast — \"It is never right to play ragtime fast,\" he wrote on his scores.",
    "related_slugs": ["rondo-alla-turca", "minute-waltz"]
  },
  {
    "slug": "liebestraum-no-3",
    "piece_title": "Liebestraum No. 3 in A-flat Major, S. 541",
    "composer": "Franz Liszt",
    "composer_lifespan": "1811–1886",
    "era": "Romantic",
    "difficulty": "Advanced",
    "year": 1850,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/Liebestr%C3%A4ume,_S.541_(Liszt,_Franz)",
    "scores_url": "https://imslp.org/wiki/Liebestr%C3%A4ume,_S.541_(Liszt,_Franz)#tabScores",
    "embed": false,
    "description": "Liebestraum No. 3, meaning \"Dream of Love,\" is the most famous of Liszt's three Liebesträume, originally composed as songs and later transcribed for solo piano around 1850. The third Liebestraum is based on a poem by Ferdinand Freiligrath, \"O lieb, so lang du lieben kannst\" (\"O love, as long as you can love\"), and its music captures the poem's theme of passionate, fleeting love.\n\nThe piece opens with a tender, arching melody above a gently rocking accompaniment in A-flat major. As the music progresses, the emotional intensity builds through increasingly rich harmonies and virtuosic cadenzas, reaching an impassioned climax before subsiding back to the opening tenderness. The Liebestraum demands a wide dynamic range, expressive rubato, and the ability to project a singing tone through complex textures — quintessential Liszt challenges for the advanced pianist.",
    "related_slugs": ["consolation-no-3", "clair-de-lune"]
  },
  {
    "slug": "prelude-e-minor-op28-no4",
    "piece_title": "Prelude in E Minor, Op. 28 No. 4",
    "composer": "Frédéric Chopin",
    "composer_lifespan": "1810–1849",
    "era": "Romantic",
    "difficulty": "Beginner",
    "year": 1839,
    "source_site": "IMSLP",
    "source_url": "https://imslp.org/wiki/Preludes,_Op.28_(Chopin,_Fr%C3%A9d%C3%A9ric)",
    "scores_url": "https://imslp.org/wiki/Preludes,_Op.28_(Chopin,_Fr%C3%A9d%C3%A9ric)#tabScores",
    "embed": false,
    "description": "Chopin's Prelude No. 4 in E minor is one of the most emotionally concentrated pieces in the piano repertoire. At just 25 bars and roughly two minutes in length, it packs an extraordinary depth of feeling into the smallest possible space. It was famously played at Chopin's own funeral in 1849, orchestrated for the occasion by Napoleon Henri Reber.\n\nThe piece consists of a descending melody in the right hand — simple, almost vocal in character — accompanied by slowly shifting chords in the left hand that create a chromatic, descending harmonic progression. The effect is one of profound melancholy and resignation, building to a quiet but devastating cadence. Its technical simplicity makes it accessible to beginners, yet its emotional depth makes it a lifelong companion for performers at every level.",
    "related_slugs": ["nocturne-op9-no2", "gymnopedie-no-1"]
  }
]
